apps/backend/chaos-tests/scenarios/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # Phase 1: Warm up (10 users for 30s)
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    # Phase 2: Ramp up (10->50 users over 60s)
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up"
    # Phase 3: Sustained load (50 users for 120s)
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    # Phase 4: Spike test (100 users for 30s)
    - duration: 30
      arrivalRate: 100
      name: "Spike test"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # Health Check Flow
  - name: "Health Check"
    weight: 20
    flow:
      - get:
          url: "/api/v2/health"
          expect:
            - statusCode: 200

  # Config API Flow
  - name: "Config API"
    weight: 15
    flow:
      - get:
          url: "/api/v2/config/document-slots"
          expect:
            - statusCode: 200
      - get:
          url: "/api/v2/config/fee-structure"
          expect:
            - statusCode: 200

  # Validation Flow
  - name: "Validation Check"
    weight: 15
    flow:
      - get:
          url: "/api/v2/validation/checklist"
          expect:
            - statusCode: 200
      - get:
          url: "/api/v2/validation/requirements?plantType=cannabis"
          expect:
            - statusCode: 200

  # Auth Stress Test
  - name: "Auth Stress"
    weight: 20
    flow:
      - post:
          url: "/api/auth/health/check-identifier"
          json:
            identifier: "1234567890123"
          expect:
            - statusCode: [200, 400, 429]

  # Protected Route Access
  - name: "Protected Route"
    weight: 15
    flow:
      - get:
          url: "/api/v2/applications"
          expect:
            - statusCode: [401, 403]

  # Invalid Endpoints
  - name: "404 Handling"
    weight: 15
    flow:
      - get:
          url: "/api/v2/nonexistent"
          expect:
            - statusCode: [404, 401]